artillery-loadtest/latency.yaml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 20 
      arrivalRate: 2
  engines:
   socketio-v3:
      transports: ["websocket"] # Erzwinge WebSocket-Verbindungen
  processor: "./custom.js" # set a custom processor to load dynamic scenario data


scenarios:
  - name: "Connections Test"
    engine: socketio-v3
    flow:
      - function: "getChatData" # load variables
      - emit:
          channel: "createUser"
          data: "{{ name }}"
        acknowledge: true
        timeout: 10000 # Timeout in Millisekunden (5 Sekunden)
      - think: 5