artillery-loadtest/verbindungstest.yaml
config:
  target: "https://api.crowdconnect.fun"
  phases:
    - duration: 60 
      arrivalRate: 10
      name: "Phase 1 - Warum Up"
    - duration: 120
      arrivalRate: 40
      name: "Phase 2 - Hauptlast"
    - duration: 60
      arrivalRate: 10
      name: "Phase 3 - Cooldown"  
  engines:
   socketio-v3:
      transports: ["websocket"] # Erzwinge WebSocket-Verbindungen
  processor: "./custom.js" # set a custom processor to load dynamic scenario data


scenarios:
  - name: "Connections Test"
    engine: socketio-v3
    flow:
      - function: "getChatData" # load variables
      - emit:
          channel: "createUser"
          data: "{{ name }}"
        acknowledge: true
        timeout: 10000 # Timeout in Millisekunden (10 Sekunden)

      - think: 30